areaMap = [{
    'name': '成都市',
    'parid': 'None',
    'border': '81,517&461,77&1428,78&1550,755&963,912&273,903'
},{
    'name': '成华区',
    'parid': '成都市',
    'border': '1127,328&1456,293&1478,560&1152,623'
},{
    'name': '郫都区',
    'parid': '成都市',
    'border': '261,431&382,215&742,275&597,640'
},{
    'name': '电子科技大学（沙河校区）',
    'parid': '成华区',
    'border': '1235,446&1223,425&1306,368&1420,381&1407,473'
},{
    'name': '电子科技大学（清水河校区）',
    'parid': '郫都区',
    'border': '376,354&453,266&583,302&592,328&577,407&521,426'
},{
    'name': '立人楼',
    'parid': '电子科技大学（清水河校区）',
    'border': '498,373&500,369&510,373&513,366&506,363&508,360&517,364&509,377'
},{
    'name': '主楼',
    'parid': '电子科技大学（清水河校区）',
    'border': '437,368&441,366&473,379&469,383'
},{
    'name': '品学楼',
    'parid': '电子科技大学（清水河校区）',
    'border': '514,357&523,344&530,348&523,351&531,353&528,359&524,357&522,359'
},{
    'name': '电子实验大楼',
    'parid': '电子科技大学（清水河校区）',
    'border': '488,349&479,344&484,333&495,338'
},{
    'name': '学生活动中心',
    'parid': '电子科技大学（清水河校区）',
    'border': '474,332&470,331&474,324&478,328'
},{
    'name': '工程研究大楼',
    'parid': '电子科技大学（清水河校区）',
    'border': '457,343&446,338&454,331&463,335'
},{
    'name': '第二教学楼',
    'parid': '电子科技大学（沙河校区）',
    'border': '1389,445&1390,436&1405,438&1404,447'
},{
    'name': '第一教学楼',
    'parid': '电子科技大学（沙河校区）',
    'border': '1388,454&1388,448&1403,449&1404,455'
},{
    'name': '主楼',
    'parid': '电子科技大学（沙河校区）',
    'border': '1286,446&1287,442&1358,452&1358,445&1362,446&1362,456'
},{
    'name': '电子学院',
    'parid': '电子科技大学（沙河校区）',
    'border': '1327,422&1327,417&1345,420&1346,425'
},{
    'name': '211工程大楼',
    'parid': '电子科技大学（沙河校区）',
    'border': '1306,403&1307,395&1333,399&1331,405'
},{
    'name': '逸夫楼',
    'parid': '电子科技大学（沙河校区）',
    'border': '1402,422&1410,423&1408,436&1401,435'
}]